#Область СлужебныйПрограммныйИнтерфейс

Функция СтоимостиТоваровНаПланете(Планета) Экспорт
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Товар");
	Результат.Колонки.Добавить("ЦенаПокупки");
	Результат.Колонки.Добавить("ЦенаПродажи");
	
	Если Планета.Пустая() Тогда
		Возврат Результат;
	КонецЕсли;
	
	ИмяПланеты = Планета.ИмяПредопределенныхДанных;
	
	Макет = ПолучитьМакет("Прейскурант");
	
	КоличествоСтрок = Макет.ВысотаТаблицы;
	КоличествоКолонок = Макет.ШиринаТаблицы;
	
	Для ИндексКолонки = 1 По КоличествоКолонок Цикл
		
		НазваниеКолонки = Макет.Область(1, ИндексКолонки).Текст;
		Если НазваниеКолонки = ИмяПланеты Тогда
			
			Для ИндексСтроки = 2 По КоличествоСтрок Цикл
				
				ЦенаПокупки = Макет.Область(ИндексСтроки, ИндексКолонки).Текст;
				Если ЦенаПокупки <> "-" Тогда
					
					ИмяТовара = Макет.Область(ИндексСтроки, 0).Текст;
					
					Товар = Справочники.Товары[ИмяТовара];
					
					ОписаниеТипаЧисло = Новый ОписаниеТипов("Число");
					ЦенаПокупки = ОписаниеТипаЧисло.ПривестиЗначение(ЦенаПокупки);
					ЦенаПродажи = Макет.Область(ИндексСтроки, ИндексКолонки + 1).Текст;
					ЦенаПродажи = ОписаниеТипаЧисло.ПривестиЗначение(ЦенаПродажи);
					
					СтрокаРезультата = Результат.Добавить();
					СтрокаРезультата.Товар = Товар;
					СтрокаРезультата.ЦенаПокупки = ЦенаПокупки;
					СтрокаРезультата.ЦенаПродажи = ЦенаПродажи;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
